---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImageFailures.InvalidWidth
source: html/fe47df7b-97b3-ed0b-2b85-0ad8d3c80d3f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImageFailures.InvalidWidth Property

The image width must be must be no more than 30000 feet.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidWidth { get; }
```